# Analyzing the relationship between education level and violent crime in California counties

**Team Members**
1. Kyle Choi
2. Nithila Balaji
3. Khalil Burrell

**Topic Overview**

Our aim is to see if there is a correlation between education level and violent crime in California. In order to do this we will calculate high school drop out rate as a parameter of education among different counties along with violent crime in two specific years and observe the relation (if there is one). We will then calculate the average across both years and see if we are able to generalize a relationship.

In [1]:
# Imports

import pandas as pd
import numpy as np
import statsmodels.api as sm

## Data Collection and Cleaning

**Dataset 1: Violent Crime data**

insert source and give basic info

In [2]:
## insert cleaned data and small explanation on steps taken

In [3]:
crime_data = pd.read_csv('violent_crime_data.csv')

# Converting string value to integers

crime_data['2017'] = crime_data['2017'].str.replace(',', '').astype(float)
crime_data['2022'] = crime_data['2022'].str.replace(',', '').astype(float)


crime_data['2017'] = pd.to_numeric(crime_data['2017'])
crime_data['2022'] = pd.to_numeric(crime_data['2022'])

crime_data.head()

      County    2017     2022
0    Alameda  9923.0  11125.0
1     Alpine    13.0     11.0
2     Amador   115.0    136.0
3      Butte   921.0   1291.0
4  Calaveras   208.0    257.0

**Dataset 2: Graduation data**

insert source

In [4]:
# Load data

grad_17 = pd.read_csv('2017gradrate.csv')
grad_22 = pd.read_csv('2022gradrate.csv')

In [5]:
grad_17.columns

Index(['AcademicYear', 'AggregateLevel', 'CountyCode', 'CountyName',
       'DistrictName', 'SchoolName', 'CharterSchool', 'ReportingCategory',
       'CohortStudents', 'Regular HS Diploma Graduates (Count)',
       'Regular HS Diploma Graduates (Rate)', 'Met UC/CSU Grad Req's (Count)',
       'Met UC/CSU Grad Req's (Rate)', 'Seal of Biliteracy (Count)',
       'Seal of Biliteracy (Rate)', 'Golden State Seal Merit Diploma (Count)',
       'Golden State Seal Merit Diploma (Rate', 'CHSPE Completer (Count)',
       'CHSPE Completer (Rate)', 'Adult Ed. HS Diploma (Count)',
       'Adult Ed. HS Diploma (Rate)', 'SPED Certificate (Count)',
       'SPED Certificate (Rate)', 'GED Completer (Count)',
       'GED Completer (Rate)', 'Other Transfer (Count)',
       'Other Transfer (Rate)', 'Dropout (Count)', 'Dropout (Rate)',
       'Still Enrolled (Count)', 'Still Enrolled (Rate)'],
      dtype='object')

In [6]:
# We will only select the necessary columns for our analysis

# List of columns to keep
columns_to_keep = ['CountyName', 'CohortStudents', 'Dropout (Count)']

# Remove all columns except the specified ones
grad_17 = grad_17[columns_to_keep]
grad_22 = grad_22[columns_to_keep]

In [7]:
grad_17.head()

  CountyName CohortStudents Dropout (Count)
0    Alameda            153              50
1    Alameda            198              74
2    Alameda              *               *
3    Alameda            161              62
4    Alameda              *               *

In [8]:
# Convert all data to integers and fill missing values with 0

grad_17_sub = grad_17.copy()

grad_17_sub['CohortStudents'] = grad_17_sub['CohortStudents'].str.replace('*', '')
grad_17_sub['Dropout (Count)'] = grad_17_sub['Dropout (Count)'].str.replace('*', '')

grad_17_sub['CohortStudents'] = pd.to_numeric(grad_17_sub['CohortStudents'])
grad_17_sub['Dropout (Count)'] = pd.to_numeric(grad_17_sub['Dropout (Count)'])

grad_22_sub = grad_22.copy()
grad_22_sub['CohortStudents'] = grad_22_sub['CohortStudents'].str.replace('*', '')
grad_22_sub['Dropout (Count)'] = grad_22_sub['Dropout (Count)'].str.replace('*', '')

grad_22_sub['CohortStudents'] = pd.to_numeric(grad_22_sub['CohortStudents'])
grad_22_sub['Dropout (Count)'] = pd.to_numeric(grad_22_sub['Dropout (Count)'])

/var/folders/xm/6y_bcpfj7wd89bh3_c027xv40000gn/T/ipykernel_12942/4121698738.py:5: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  grad_17_sub['CohortStudents'] = grad_17_sub['CohortStudents'].str.replace('*', '')
/var/folders/xm/6y_bcpfj7wd89bh3_c027xv40000gn/T/ipykernel_12942/4121698738.py:6: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  grad_17_sub['Dropout (Count)'] = grad_17_sub['Dropout (Count)'].str.replace('*', '')
/var/folders/xm/6y_bcpfj7wd89bh3_c027xv40000gn/T/ipykernel_12942/4121698738.py:12: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  grad_22_sub['CohortStudents'] = grad_22_sub['CohortStudents'].str.replace('*', '')#.astype(float)
/var/folders/xm/6y_bcpfj7wd89bh3_c027xv40000gn/T/ipykernel_12942/4121698738.py:13: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  grad_22_sub['Dropout (Count)'] = grad_22_sub['Dropout (Count)'].str.replace('*', '')#.astype(float)

In [9]:
grad_17_sub.head()

  CountyName  CohortStudents  Dropout (Count)
0    Alameda           153.0             50.0
1    Alameda           198.0             74.0
2    Alameda             NaN              NaN
3    Alameda           161.0             62.0
4    Alameda             NaN              NaN

In [10]:
# Originally each high school was listed separately. We want to groupby county and have the total sums

grad_17_sub=grad_17_sub.groupby('CountyName').sum()
grad_22_sub=grad_22_sub.groupby('CountyName').sum()

In [11]:
grad_17_sub.head()

            CohortStudents  Dropout (Count)
CountyName
Alameda           506348.0          45814.0
Alpine                 0.0              0.0
Amador              9216.0            882.0
Butte              74011.0           6604.0
Calaveras          16327.0            767.0

In [12]:
grad_22_sub.head()

            CohortStudents  Dropout (Count)
CountyName
Alameda           335763.0          27480.0
Amador              5827.0            250.0
Butte              48227.0           4118.0
Calaveras           7839.0            259.0
Colusa              7102.0            276.0

In [13]:
# Make single dataframe with rates from both

grad_17_sub = grad_17_sub.reset_index()
grad_22_sub = grad_22_sub.reset_index()

# Calculate dropout rates

grad_17_sub['Dropout_Rate_17'] = (grad_17_sub['Dropout (Count)'] / grad_17_sub['CohortStudents']) * 100
grad_22_sub['Dropout_Rate_22'] = (grad_22_sub['Dropout (Count)'] / grad_22_sub['CohortStudents']) * 100

df_merged = pd.merge(grad_17_sub[['CountyName', 'Dropout_Rate_17']], grad_22_sub[['CountyName', 'Dropout_Rate_22']], on='CountyName', how='outer')

# Rename columns for clarity

df_merged.rename(columns={'CountyName': 'County', 'Dropout_Rate_17': 'Dropout_17', 'Dropout_Rate_22': 'Dropout_22'}, inplace=True)
df_merged.fillna(0, inplace=True)
df_merged.head()

      County  Dropout_17  Dropout_22
0    Alameda    9.047928    8.184344
1     Alpine    0.000000    0.000000
2     Amador    9.570312    4.290372
3      Butte    8.922998    8.538785
4  Calaveras    4.697740    3.303993

## Regression

**Hypotheses**

Null Hypothesis (H$_0$): There is no relationship between violent crime rates and high school graduation rate across counties in California in the two selected years.

Alternate Hypothesis (H$_a$): There is a positive relationship between violent crime and high school graduation rates across counties in California in the two selected years.

In [14]:
# Combine data

df_combined = pd.merge(df_merged, crime_data, on='County')
df_combined.head()

      County  Dropout_17  Dropout_22    2017     2022
0    Alameda    9.047928    8.184344  9923.0  11125.0
1     Alpine    0.000000    0.000000    13.0     11.0
2     Amador    9.570312    4.290372   115.0    136.0
3      Butte    8.922998    8.538785   921.0   1291.0
4  Calaveras    4.697740    3.303993   208.0    257.0

In [15]:
# Define the independent and dependent variables for 2017
X_2017 = df_combined[['Dropout_17']]
y_2017 = df_combined['2017']

# Add a constant to the independent variables
X_2017 = sm.add_constant(X_2017)

# Fit the regression model for 2017
model_2017 = sm.OLS(y_2017, X_2017).fit()

# Print the regression results for 2017
print("Regression results for 2017:")
print(model_2017.summary())

# Define the independent and dependent variables for 2022
X_2022 = df_combined[['Dropout_22']]
y_2022 = df_combined['2022']

# Add a constant to the independent variables
X_2022 = sm.add_constant(X_2022)

# Fit the regression model for 2022
model_2022 = sm.OLS(y_2022, X_2022).fit()

# Print the regression results for 2022
print("Regression results for 2022:")
print(model_2022.summary())

Regression results for 2017:
                            OLS Regression Results
==============================================================================
Dep. Variable:                   2017   R-squared:                       0.000
Model:                            OLS   Adj. R-squared:                 -0.018
Method:                 Least Squares   F-statistic:                  0.006644
Date:                Thu, 06 Jun 2024   Prob (F-statistic):              0.935
Time:                        00:20:55   Log-Likelihood:                -604.01
No. Observations:                  58   AIC:                             1212.
Df Residuals:                      56   BIC:                             1216.
Df Model:                           1
Covariance Type:            nonrobust
==============================================================================
                 coef    std err          t      P>|t|      [0.025      0.975]
------------------------------------------------------------------------------
const       3197.1194   1810.769      1.766      0.083    -430.287    6824.526
Dropout_17   -12.1183    148.675     -0.082      0.935    -309.951     285.714
==============================================================================
Omnibus:                      112.968   Durbin-Watson:                   2.046
Prob(Omnibus):                  0.000   Jarque-Bera (JB):             4157.626
Skew:                           6.071   Prob(JB):                         0.00
Kurtosis:                      42.661   Cond. No.                         20.6
==============================================================================

Notes:
[1] Standard Errors assume that the covariance matrix of the errors is correctly specified.
Regression results for 2022:
                            OLS Regression Results
==============================================================================
Dep. Variable:                   2022   R-squared:                       0.000
Model:                            OLS   Adj. R-squared:                 -0.018
Method:                 Least Squares   F-statistic:                  0.001060
Date:                Thu, 06 Jun 2024   Prob (F-statistic):              0.974
Time:                        00:20:55   Log-Likelihood:                -605.94
No. Observations:                  58   AIC:                             1216.
Df Residuals:                      56   BIC:                             1220.
Df Model:                           1
Covariance Type:            nonrobust
==============================================================================
                 coef    std err          t      P>|t|      [0.025      0.975]
------------------------------------------------------------------------------
const       3368.0677   1661.794      2.027      0.047      39.095    6697.041
Dropout_22    -4.2706    131.163     -0.033      0.974    -267.023     258.481
==============================================================================
Omnibus:                      109.073   Durbin-Watson:                   2.054
Prob(Omnibus):                  0.000   Jarque-Bera (JB):             3565.720
Skew:                           5.767   Prob(JB):                         0.00
Kurtosis:                      39.639   Cond. No.                         19.0
==============================================================================

Notes:
[1] Standard Errors assume that the covariance matrix of the errors is correctly specified.

## Analysis

## Conclusion